backend/app/models/item_code.rb

    def matching_parameters
        if item.product.has_item_params?
            unless item_code_parameter.products.include?(item.product)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "products" INNER JOIN "product_item_parameters" ON "products"."id" = "product_item_parameters"."product_id" WHERE "product_item_parameters"."item_code_parameter_id" = ? AND "products"."id" = ? LIMIT ?  [["item_code_parameter_id", 14], ["id", 13], ["LIMIT", 1]]