backend/app/controllers/items_controller.rb

    def create
        item = Item.create(item_params)
---
INSERT INTO "items" ("product_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["product_id", 4], ["created_at", "2021-05-13 20:15:48.470008"], ["updated_at", "2021-05-13 20:15:48.470008"]]