backend/app/controllers/products_controller.rb

    def create
        product = Product.create(product_params)
---
INSERT INTO "products" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sam"], ["description", "Tester"], ["created_at", "2021-05-08 04:31:27.913584"], ["updated_at", "2021-05-08 04:31:27.913584"]]

    def destroy
        find_product
        @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 3]]

    def find_product
        @product = Product.find_by_id params[:id]
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]