backend/app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def show
        product = Product.find_by_id params[:id]